app/Controllers/APIController.php

    public function updateWeldID()
    {
        // Get the incoming request data
        $machineID = $this->request->getGet('MachineID');
        $apiKey = $this->request->getGet('apiKey');

        // Validate the API key
        if ($apiKey !== $this->apiKey) {
            return $this->response->setStatusCode(403)->setBody("API key invalid.");
        }

        // Load the database connection
        $db = \Config\Database::connect();

        // Fetch the row with the largest WeldID value for the specified MachineID
        $builder = $db->table('machine');
        $builder->selectMax('WeldID');
        $builder->where('MachineID', $machineID);
        $query = $builder->get();
---
SELECT MAX(`WeldID`) AS `WeldID`
FROM `machine`
WHERE `MachineID` = 'A20-2534'

            ];

            $updateBuilder->where('MachineID', $machineID);
            if ($updateBuilder->update($updateData)) {
---
UPDATE `machine` SET `WeldID` = 2
WHERE `MachineID` = 'A20-2534'

    public function updateMachineData()
    {
        // Load the database connection
        $db = \Config\Database::connect();

        // Read input data from GET request
        $Area = $this->request->getGet('Area');
        $UID = $this->request->getGet('UID');
        $MachineID = $this->request->getGet('MachineID');
        $Status = $this->request->getGet('Status');
        $WeldID = $this->request->getGet('weldID');
        $CurrentDC = $this->request->getGet('currentDC');
        $VoltageDC = $this->request->getGet('voltageAverage');
        $apiKey = $this->request->getGet('apiKey');

        if ($apiKey !== $this->apiKey) {
            return $this->response->setStatusCode(400)->setBody("API key invalid.");
        }

        // Set timezone and get current time
        date_default_timezone_set('Asia/Jakarta');
        $Time = date('H:i:s');  // TIME format
        $Date = date('Y-m-d');  // DATE format
        $DateTime = date('Y-m-d H:i:s');  // DATETIME format

        // Check if the UID exists in the employee table
        $builder = $db->table('employee');
        $query = $builder->select('Name')->where('cardUID', $UID)->get();
---
SELECT `Name`
FROM `employee`
WHERE `cardUID` = 'A20-2534'